src/DataProcessors/ЗагрузкаПараметровНоменклатуры/ЗагрузкаПараметровНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаПараметровНоменклатуры</name>
</mdclass:DataProcessor>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Виртуальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНахожденияВБуфере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоМощности</name>
    <type>
      <types>CatalogRef.ГруппыПоМощности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияСпецификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Канбан</name>
    <type>
      <types>CatalogRef.ВидыКанбанов</types>
    </type>
  </attributes>
  <attributes>
    <name>КолВКанбане</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолКанбан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Промывка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловныеПриборы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловныйКоэффициентПЭО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблоныТО</name>
    <type>
      <types>CatalogRef.ШаблоныТехОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроизводства</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноКОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходНаРедизайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛинииSMD</name>
    <attributes>
      <name>Линия</name>
      <type>
        <types>CatalogRef.ЛинииSMD</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиSMD</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ЗагрузкаПараметровНоменклатуры/Forms/Форма/Module.bsl
&НаСервере
Процедура ИзменитьНаСервере(Запись)
Выбор = Справочники.Номенклатура.НайтиПоНаименованию(Запись.Наименование,Истина);
	Если Не Выбор.Пустая() Тогда
	Ном = Выбор.ПолучитьОбъект();
	флИзменен = Ложь;
    ЗначениеПараметра = Неопределено;			
    	Если Запись.Свойство("МинОстаток",ЗначениеПараметра) Тогда
			Если Ном.МинОстаток <> ЗначениеПараметра Тогда
			Ном.МинОстаток = ЗначениеПараметра;
			флИзменен = Истина;		
			КонецЕсли; 
		КонецЕсли;
	ЗначениеПараметра = Неопределено;
    	Если Запись.Свойство("ДатаПересмотра",ЗначениеПараметра) Тогда
			Если Ном.ДатаПересмотра <> ЗначениеПараметра Тогда
			Ном.ДатаПересмотра = ЗначениеПараметра;
			флИзменен = Истина;
			КонецЕсли; 
		КонецЕсли;
			Если флИзменен Тогда
			Ном.Записать();
			КонецЕсли;
	Иначе
    Сообщить(Запись.Наименование+" не найден!");
	КонецЕсли; 
КонецПроцедуры 

&НаСервере
Процедура ОчиститьНаСервере()
Выборка = Справочники.Номенклатура.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда
		Продолжить;		
		КонецЕсли;                        
			Если Выборка.Ссылка.МинОстаток > 0 Тогда
			Ном = Выборка.Ссылка.ПолучитьОбъект();
			Ном.МинОстаток = 0;
			Ном.Записать();
			КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	Для каждого ТЧ Из ТаблицаПараметров Цикл
		Если СокрЛП(ТЧ.Параметр) = "выберите соответствие" Тогда
		Сообщить("Не все колонки идентифицированы!");
		Возврат;
		КонецЕсли;	
	КонецЦикла;
		Если ОчиститьНеснижаемыеЗапасы Тогда
		Состояние("Обработка...",,"Очистка параметров...");
		ОчиститьНаСервере();
		КонецЕсли;
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c параметрами номенклатуры",ИмяФайла);
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	КолКолонок = Результат.КоличествоКолонок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка параметров из файла..."); 
		Запись = Новый Структура();

		Запись.Вставить("Наименование",СокрЛП(ExcelЛист.Cells(к,1).Value));
			Для л = 0 по КолКолонок - 2 Цикл
            Запись.Вставить(ТаблицаПараметров[л].Параметр,СокрЛП(ExcelЛист.Cells(к,л+2).Value));
			КонецЦикла;	
        ИзменитьНаСервере(Запись);
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
 КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;            
ТаблицаПараметров.Очистить();
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c параметрами номенклатуры");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	ИмяФайла = Результат.ПолноеИмяФайла;
		Для к = 2 По Результат.КоличествоКолонок Цикл
		ТЧ = ТаблицаПараметров.Добавить();
		ТЧ.НомерКолонки = к;
		ТЧ.НаименованиеВфайле = СокрЛП(ExcelЛист.Cells(1,к).Value);
		ВыбЗнач = Элементы.ТаблицаПараметровПараметр.СписокВыбора.НайтиПоЗначению(ТЧ.НаименованиеВфайле);
			Если ВыбЗнач <> Неопределено Тогда
			ТЧ.Параметр = ВыбЗнач.Значение;
			Иначе
			ТЧ.Параметр = "выберите соответствие";			
			КонецЕсли;
		КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры
